package org.example.users;

import java.util.ArrayList;
import java.util.HashMap;

public class Array_TEXT {
    public static HashMap<Integer, String> text = new HashMap<Integer, String>() {
        {
            put(101, "F ЛVдеры, новаGоры, сGремяGся \n" +
                    "быGь номером 1 во все\u0098\n" +
                    "F ОпGVмVсGы, позVGVвные лBдU\n" +
                    "F ГенераGоры Vде\u009C\n" +
                    "F РешVGельные V волевые, легко \n" +
                    "адапGVруBGся к новым условVя\u0098\n" +
                    "F Успешные лBдV, занVмаBG \n" +
                    "высокVе должносGV, оGлVчные \n" +
                    "управленцы, умеBG весGV \n" +
                    "за собоK другV>");

            put(102, "F ИнGуVцVя, глубокое чувсGвованVе \n" +
                    "окружаBщV=\n" +
                    "F ДVпломаGы, умеBG сглажVваGь \n" +
                    "осGрые углы, на>одVGь под>од \n" +
                    "к лBбому человекÃ\n" +
                    "F Сдержанные, спокоKные, \n" +
                    "загадочны\u007F\n" +
                    "F ОбладаBG целVGельскVмV \n" +
                    "V эзоGерVческVмV способносGямU\n" +
                    "F СVльная связь с прVродо\u009C\n" +
                    "F ХорошVе ораGоры");

            put(103, "D Арт7ст7чны5 7 творч5ск75, 7м5ют \n" +
                    "богатую фантаз7ю, чувство вкуса \n" +
                    "7 ст7лx\n" +
                    "D Хорош75 управл5нEы, \n" +
                    "руковод7т5л6\n" +
                    "D Ощущают с5б$ корол5вам7 \n" +
                    "по ж7зн6\n" +
                    "D Про$вл$ют заботу, н5жность \n" +
                    "к друг7^\n" +
                    "D Дл$ н7х важна с5мь$, люб$т д5т5й");

            put(104, " Муж5ств5нность, внутр5нн7й \n" +
                    "ст5рж5нь, с7л®\n" +
                    "D Отв5тств5нность, \n" +
                    "с7ст5мат7чность, пор$док во вс5^\n" +
                    "D Стаб7льность, самодостаточност`\n" +
                    "D Ум5ют пр7н7мать взв5ш5нны5 \n" +
                    "р5ш5н7$ даж5 в самых трудных \n" +
                    "с7туаE7$\u009F\n" +
                    "D Отл7чны5 руковод7т5л7 на \n" +
                    "работ5, главы с5м5¯\n" +
                    "D Н5 бо$тс$ любого труда");
            put(105, "> Ч?я? ?радиции, 5ормы и 8с?ои, \n" +
                    "при э?ом прив5ося? в 5их ч?о‑?о \n" +
                    "5ово@\n" +
                    "> ИмAю? а5али?ичAскоA мышлA5иA, \n" +
                    "способ5ос?0 рассчи?ыва?0 \n" +
                    "и прог5озирова?/\n" +
                    "> Любя? свобод8, раз5ообразиA \n" +
                    "во всAf\n" +
                    "> Пос?оя55о 58ждаю?ся в 5овой \n" +
                    "и5формации, любоз5а?Aл05ыA \n" +
                    "и раз5ос?оро55и@\n" +
                    "> Любя? 8чи?0ся и имAю? \n" +
                    "дар 8чи?Aлs\n" +
                    "> ХорошиA ора?оры");

            put(106, "ЦA5я? гармо5ию, комфор? \n" +
                    "и красо?8 во всAf\n" +
                    "> ИмAю? о?лич5оA ч8вс?во вк8са \n" +
                    "и с?иля, ?яго?Aю? к иск8сс?в7\n" +
                    "> МилыA, прия?5ыA, \n" +
                    "доброжAла?Aл05ыA, \n" +
                    "5Aко5флик?5ы@\n" +
                    "> ИмAю? дар в р8ка");

            put(107, "/ Энерги! воина, победител \n" +
                    "/ jктивнSе, смелSе, \n" +
                    "самосто!тельнSе, \n" +
                    "целеустремлённSе люд\u007F\n" +
                    "/ Люб!т путешестви!, активнSй \n" +
                    "образ жизни, стрем!тс! \n" +
                    "к посто!нному развитию \n" +
                    "и движени^\n" +
                    "/ Интуици!, проницательность, \n" +
                    "чувствуют ложc\n" +
                    "/ Имеют поддержку вSсших \n" +
                    "сил (ангеловi\n" +
                    "/ Люб!т докапSватьс! до сути \n" +
                    "вещей");
            put(108, "/ Соблюдают законS, цен!т \n" +
                    "нравственность и моралc\n" +
                    "/ ЧестнSе и пор!дочнS\u0090\n" +
                    "/ Имеют чувство долга \n" +
                    "и ответственности 4 Пон=мают пр=ч=нно\u0002следственные связ<\n" +
                    "4 Трудолюб=вые, мно\"о работают \n" +
                    "рад= статуса = дене!\n" +
                    "4 За = ают слабы\u001F\n" +
                    "4 Бо\"атые, успешные, строят свой \n" +
                    "крупный б=знес, с=стемы, \n" +
                    "опер=руют больш=м= день\"ам=");

            put(109, " Пр=родная мудрость, знан=я, \n" +
                    "ф=лософск=й вз\"ляд на м=\u0092\n" +
                    "4 Сочувств=е = сопереж=ван=е, \n" +
                    "отзывч=вость, воспр==мч=вость \n" +
                    "к чужой бол<\n" +
                    "4 Эзотер=ческ=й потенц=ал, \n" +
                    "способность в=деть ве =е сны, \n" +
                    "сч=тывать знак<\n" +
                    "4 Талантл=вые, у\"лубляются во все, \n" +
                    "что =зучают, поэтому отл=чно \n" +
                    "проявляют себя в любой сферp\n" +
                    "4 Самодостаточные, наполняются \n" +
                    "энер\"=ей в од=ночестве");

        }
    };


    public static String getTextFromArkan(int key) {
        return text.get(key);
    }

    public static String getTextFromArkan(int key, int arkan) {
        System.out.println((arkan * 100) + key);
        return text.get((arkan * 100) + key);
    }


}
